{"id": "10", "url": [{"path": "/audio/MainTrailMammals.wav", "type": "audio", "imageAlt": ""}, {"path": "/photos/MainTrailMammal-Image1.jpg", "type": "image", "imageAlt": "", "description": ["Description: The striped skunk is a stoutly built, short-limbed animal with a small, pointed head and a long, heavily furred tail. The color patterns of the fur vary greatly but generally consist of a black base with a white stripe extending from the head which divides along the shoulders, continuing along the sides to the rear and tail. Some skunks have a white patch on the chest, while others bear white stripes on the outer surface of the front limbs. Brown or cream-colored mutations occasionally occur.", "Reproductive habits: The striped skunk is polygamous (meaning they have multiple mates) and normally breeds once a year. The pregnancy lasts around 59-77 days, litters generally consist of 2-12 babies, with the average being five or six.", "Interesting Facts: The striped skunk is an excellent climber and swimmer. The skunk is omnivorous, which means it eats both plants and animals. The striped skink is nocturnal and solitary, spending most of its time alone except during breeding season. They are not a threat to humans, but its defensive spray can be very unpleasant."]}, {"path": "/photos/MainTrailMammal-Image2.jpg", "type": "image", "imageAlt": "", "description": ["Description: The eastern gray squirrel has predominantly gray fur, but it can have a brownish color. It has a usual white underside as compared to the typical brownish-orange underside of the fox squirrel. It has a large bushy tail.", "Reproductive habits: Eastern Gray squirrels often breed twice a year. Eastern Gray squirrels are mammals that give birth to live young, and their pregnancy periods normally last 44 days, with their newborn weaned after 10 weeks.", "Interesting facts: Eastern grey squirrels possess remarkable spatial memory skills. They can remember the location of several food stashes, buried acorns, and hiding spots, even months after burying them."]}, {"path": "/photos/MainTrailMammal-Image3.jpg", "type": "image", "imageAlt": "", "description": ["Description: The eastern cottontail has a white spot on its forehead, red-brown or gray-brown fur, with large hind feet, long ears, and a short, fluffy white tail. Its underside fur is white. There is a rusty patch on the tail.", "Reproductive habits: The eastern cottontail can reach sexual maturity as early as 2-3 months of age. Most females first breed the spring following birth, but 10% to 36% of females breed as juveniles. Males will mate with more than one female. Female rabbits can have one to seven litters a year, with each litter birthing one to twelve young, called kits.", "Interesting Facts: They possess nearly 100 million scent receptors in their noses and can twitch their noses rapidly."]}], "description": ["In our own backyards, a quiet drama of survival and adaptation unfolds each day, starring familiar faces like the Eastern Grey Squirrel, the Eastern Cottontail, and the Striped Skunk. These animals, often dismissed as pests, are in fact vital players in a thriving natural ecosystem. The squirrel plants future forests with forgotten acorns, the cottontail helps maintain plant diversity through selective grazing, and the skunk keeps insect and rodent populations in check. Observing them in their natural habitat offers a chance to shift our perspective—from nuisance to neighbor. Take a moment to watch their behaviors, notice their patterns, and appreciate the roles they play. It's a gentle reminder that even the most common creatures are part of a larger, interconnected world worth respecting and protecting."], "image": ""}