{"id": "15", "url": [{"path": "/audio/MainTrailMisc.mp3", "type": "audio"}, {"path": "/photos/MainTrailMisc-Image1.jpg", "type": "image", "imageAlt": "Photo of a small slender snake on the ground", "title": "Butler's Gartersnake", "description": ["Description:  a small, slender snake, averaging 38-51 cm in total length, with three yellow to orange stripes along the length of its body.", "Reproductive habits: This snake is ovoviviparous, meaning they re produce by laying and hatching eggs. Mating takes place in late March and early April and the young are born in broods of four to 14.", "Interesting facts: In all of Canada, Butler's gartersnakes are found only in scattered areas across Southern Ontario, including the City of Windsor. Butler's gartersnake is an Endangered Species that is protected under the Ontario Endangered Species Act (2007)."]}, {"path": "/photos/MainTrailMisc-Image2.jpg", "type": "image", "imageAlt": "Photo of a peregrine falcon atop a rock", "title": "Peregrine Falcon", "description": ["Description: The peregrine falcon has a body length of 34 to 58 cm and a wingspan from 74 to 120 cm. The male and female have similar markings and plumage but, the peregrine falcon displays marked sexual dimorphism (meaning distinct difference in size or appearance between the sexes of an animal) in size, with the female measuring up to 30% larger than the male.", "Reproductive habits: The peregrine falcon reaches sexual maturity at one to three years old, but in larger flocks, it breeds at two to three years old. A pair mates for life and returns to the same nesting location each year. In the northern hemisphere they lay eggs in February to March, and in the southern hemisphere in July to August.", "Interesting facts: The Peregrine falcon has nested on the Ambassador Bridge and can often been seen flying in the air space around this iconic structure."]}, {"path": "/photos/MainTrailMisc-Image3.jpg", "type": "image", "imageAlt": "Photo of an insect on the ground atop a cicada", "title": "Cicada Killer", "description": ["Description: They are approximately two inches in length, black or dark brown, with colourful yellow markings on several segments of their abdomen and amber wings.", "Reproductive habits: They lay eggs, the eggs hatch into larvae which then burrow underground.", "Interesting facts: The female wasp of this species can predetermine the sex of their offspring and make sure more females are born than males. Cicada killers are not aggressive and rarely sting, unless they are stepped on with bare feet or grasped roughly."]}, {"path": "/photos/MainTrailMisc-Image4.jpg", "type": "image", "imageAlt": "Photo of a chimney swift soaring through a blue sky", "title": "Chimney Swift", "description": ["Description: a small, cigar-shaped bird with long, narrow, curved wings and a short, stubby tail. Its plumage is sooty grey-brown, and it's often seen flying high in the sky in rapid, erratic patterns as it hunts for insects.", "Reproductive habits: Chimney Swifts are monogamous and typically breed once per year. They build their nests inside chimneys or similar vertical structures using twigs glued together with their saliva. The female lays 3-5 white eggs, and both parents share incubation duties for about 18-21 days. After hatching, the chicks remain in the nest for about a month before fledging. Swifts often return to the same nesting site year after year.", "Interesting facts: Chimney Swifts spend almost their entire lives in flight, eating, drinking, and even bathing on the wing. Unlike most birds, Chimney Swifts cannot perch; instead, they cling vertically to surfaces using their strong claws and tail bristles. Historically, they nested in hollow trees, but today they commonly use chimneys and other vertical man-made structures."]}, {"path": "/photos/ChimneySwiftArt.png", "type": "image", "imageAlt": "Drawing of a chimney swift", "title": "Chimney Swift", "description": ["Drawing by Bronwen Wood, 2025"]}], "description": ["As you wander the main trails, take a moment to pause. Look up to the sky where raptors may be gliding on thermals, their wings outstretched in silent grace. Look down and notice the tiny worlds beneath your feet—ants marching, beetles scurrying, and wildflowers blooming in bursts of colour. Listen closely to the hum of insects, the rustle of leaves, and the songs of birds echoing through the trees. Life is all around you here—vibrant, wild, and waiting to be discovered. Be present, be curious, and let the park reveal its wonders to you."]}