{"id": "20", "url": [{"path": "/audio/MainTrailNativefinal.wav", "type": "audio", "imageAlt": ""}, {"path": "/photos/MainTrailNative-Image1.jpg", "type": "image", "imageAlt": "", "description": ["Description: The Biennial Gaura is a tall, slender plant in the evening primrose family (Onagraceae), native to much of eastern and central North America. In its first year, it forms a basal rosette of leaves. In the second year, it bolts and grows up to 3-7 feet tall with branching stems covered in fine white hairs. Its narrow, lance-shaped leaves are arranged alternately along the stem. The plant produces delicate white to pink flowers with four petals, which bloom from mid-summer to mid-autumn", "Reproductive habits: Biennial Gaura reproduces sexually through cross-pollination, primarily by long-tongued bees and moths. The flowers are gradually replaced by spindle-shaped seed capsules that contain a few seeds each. These seeds are dispersed to establish new plants, which follow the same two-year life cycle", "Interesting facts: In Ontario and other parts of eastern North America, Biennial Gaura is often found in disturbed habitats such as roadsides, and abandoned fields. It prefers full sun and can grow in a variety of soil types, including loam, clay, and sandy soils."]}, {"path": "/photos/MainTrailNative-Image9.jpg", "type": "image", "imageAlt": "", "description": ["Description: Tall goldenrod (Solidago altissima) is a tall, native perennial plant found throughout Windsor, Ontario. It grows up to 2 meters high with narrow leaves and bright yellow flower clusters that bloom in late summer and fall.", "Reproductive habits: It reproduces both by wind-dispersed seeds and underground rhizomes, allowing it to spread quickly and form dense colonies. The plant also releases chemicals into the surrounding soil that suppress nearby vegetation, helping it dominate open areas.", "Interesting facts: In Windsor, tall goldenrod supports local biodiversity including many pollinators like bees and butterflies. It often hosts insect galls—swellings caused by insects—which are common in local fields and studied in ecology. Goldenrod is often confused with Ragweed and is unfairly blamed for seasonal allergies. Ragweed pollen is wind-blown and causes allergy symptoms in many people. Goldenrod pollen is transferred by insects from plant to plant and will not cause seasonal allergies because it is not carried by the wind.   "]}, {"path": "/photos/MainTrailNative-Image6.jpg", "type": "image", "imageAlt": "", "description": ["Description: A tall, native perennial wildflower with broad, oblong leaves and clusters of fragrant pink to purplish flowers that bloom from June to August. It exudes a milky sap when cut and can grow 3 to 6 feet tall. Found in meadows, roadsides, and gardens, it's a favorite among pollinators", "Reproductive habits: Milkweed spreads by both wind-dispersed seeds and underground rhizomes, allowing it to form dense colonies. Its flowers are pollinated by insects, especially bees and butterflies. It's also the primary host plant for monarch butterflies.", "Interesting facts: Monarchs lay their eggs exclusively on milkweed — it's their nursery and lunchroom in one. The plant's milky sap contains toxic compounds that deter most herbivores — and make monarchs taste bad to predators. Though it can spread aggressively, it's a keystone species in pollinator gardens and restoration projects"]}, {"path": "/photos/MainTrailNative-Image7.jpg", "type": "image", "imageAlt": "", "description": ["Description: A towering, fast-growing deciduous tree that can reach 80-100 feet tall with a broad crown and thick trunk. Its triangular, toothed leaves shimmer in the breeze, and its bark shifts from smooth and greenish-gray in youth to deeply furrowed and ashy-gray with age", "Reproductive habits: Cottonwoods reproduce primarily by wind-dispersed seeds, which are attached to silky white fibers — hence the “cotton” in the name. They also propagate easily from cuttings, making them popular for reforestation and erosion control", "Interesting facts: One of the fastest-growing trees in North America — perfect for quick shade or windbreaks. Despite its size, it rarely lives beyond 80 years. Thrives in floodplains and along rivers, where the roots have access to plenty of water."]}, {"path": "/photos/MainTrailNative-Image8.jpg", "type": "image", "imageAlt": "", "description": ["Description: A vigorous, woody vine native to North America, Riverbank Grape can climb up to 75 feet using tendrils. It has reddish-brown bark that peels in strips, and heart-shaped, toothed leaves. In late spring, it produces clusters of tiny, fragrant yellow-green flowers, followed by bluish-black grapes in late summer", "Reproductive habits: Reproduces by seeds. While seeds can be slow to start, they're often dispersed by birds and small mammals. The plant thrives in full sun and moist to dry soils, often colonizing riverbanks, thickets, and disturbed areas", "Interesting facts: The grapes are tart but edible — great for jellies and juice (if you beat the birds to them). Provides food and cover for birds, mammals, and pollinators like bees. It can smother small trees and shrubs if left unchecked. The riverbank grape offers year-round interest — from spring blooms to fall fruit and winter bark."]}, {"path": "/photos/MainTrailNative-Image10.jpg", "type": "image", "imageAlt": ""}], "description": ["As you explore Gateway Park, take a moment to truly relish the rich tapestry of plants that surround you. While many of the species you'll see were introduced from other places—or are even considered invasive—the real heart of this landscape lies in its native flora. These native plants are the quiet heroes of the ecosystem, forming the foundation that supports local wildlife, stabilizes soil, and maintains the balance of the ecosystem. By learning to recognize and appreciate these native species, you're not just enjoying the beauty of the park—you're connecting with the living legacy of the land itself."], "timeline": null, "image": null}