{"id": "23", "url": [{"path": "/audio/GEE.mp3", "type": "audio"}, {"path": "/photos/GEE-Image1.png", "type": "image", "imageAlt": "Logo for the GEE project"}, {"path": "/photos/GEE-Image2.jpg", "type": "image", "imageAlt": "Photo of a person standing in front of a large butterfly sculpture with their arms stretched out"}, {"path": "/photos/GEE-Image3.jpg", "type": "image", "imageAlt": "Photo of a garden bed"}, {"path": "/photos/GEE-Image4.png", "type": "image", "imageAlt": "Photo of the exterior of the Mason Educational Centre"}], "description": ["Unlock Your Future at Mason Educational Centre!", "Your Path. Your Pace. Your Potential.", "If you're looking for a fresh start or a flexible way to earn your OSSD, the Mason Educational Centre is here for you. Whether you've faced challenges in traditional school settings or just need a different approach, Mason offers powerful programs designed to help you succeed:", "Public Alternative Secondary School (PASS)", "PASS is not your typical high school. It's a supportive, inclusive space where your voice matters and your goals are the focus. Here's what makes it special:", "- A Flexible schedule that fits your life", "- Smaller class sizes for more personalized support", "- Hands-on learning through projects like the GEE Project (gardening, art, and community service)", "- Earn credits in a way that feels meaningful and empowering", "Whether you're behind on credits or just need a different environment to thrive, PASS helps you move forward—your way.", "Adult & Continuing Education Programs", "For students 19+ or those returning to school, Mason also offers:", "- OSSD completion for adults", "- Co-op and Maturity Credits to fast-track your diploma", "- Night school and e-learning options", "- English as a Second Language (ESL)", "- Literacy and Basic Skills upgrading", "These programs are designed to meet you where you are and help you get where you want to go—whether that's college, a career, or personal growth.", "The GEE Project—short for Ground, Engage, Express—is a vibrant, community-rooted initiative born from the passion of the staff at the Public Alternative Secondary School and the visionary leadership of educator-extraordinaire Grace Kim. As part of United Way's Cradle to Career and On Track to Success programs, the GEE Project empowers students through hands-on, outdoor experiences that blend sustainability, creativity, and civic engagement.", "This summer program invites students to connect deeply with their environment and community through gardening, visual arts, and urban renewal projects. It's more than just a way to earn community service hours for graduation (as outlined in PPM 124)—it's a meaningful journey of self-expression, environmental stewardship, and collective pride.", "Aligned with the Greater Essex County District School Board's Climate Action Plan and Board Improvement and Equity Plan, the GEE Project immerses youth in sustainable activism and community service. From planting gardens to painting murals, students are not only transforming spaces—they're transforming themselves.", "What makes the GEE Project even more special is its cross-border collaboration with partners like Detroit Outdoors, allowing students and educators to share best practices and broaden their impact beyond Windsor.", "In every seed planted and every brushstroke made, the GEE Project is cultivating a future rooted in equity, creativity, and community.", "Why Choose Mason?", "- Learn in a judgment-free zone", "- Get real-world skills and community experience", "- Connect with caring educators who believe in your success", "GEE Project on Instagram - @geeprojectYQG"]}