{"id": "30", "url": [{"path": "/audio/UpperTrailBirdsfinal.mp3", "type": "audio"}, {"path": "/photos/UpperTrailBirds-Image1.jpg", "type": "image", "imageAlt": "Photo of a small bird with a white front, grey upper body, and rust-colour under the wings", "title": "Tufted Titmouse", "description": ["Description: A small songbird with a white front and grey upper body outlined with rust-coloured flanks. Other characteristics include its black forehead and the tufted grey crest on its head.", "Reproductive habits: They lay small eggs in tree cavities. The eggs measure under 1 inch long and are white or cream-coloured with brownish or purplish spots. Average clutch size is five to seven eggs.", "Interesting facts:  On April 12, 2023, the tufted titmouse was announced Windsor, Ontario's official bird."]}, {"path": "/photos/TuftedTitmouseArt.png", "type": "image", "imageAlt": "Drawing of a Tufted Titmouse", "title": "Tufted Titmouse", "description": ["Drawing by Bronwen Wood, 2025"]}, {"path": "/photos/UpperTrailBirds-Image2.jpg", "type": "image", "imageAlt": "Photo of a blue, white, and reddish-brown bird standing on a wooden structure", "title": "Barn Swallow", "description": ["Description: It is a distinctive passerine bird with blue upperparts and a long, deeply forked tail. The adult male has shiny blue feathers on top, a reddish-brown face and throat, and a dark blue band across the chest. The female looks similar but is duller and has shorter tail feathers. Young birds are browner, with lighter faces and no long tail feathers", "Reproductive habits: Barn swallows lay eggs. The nest building ability of the male will decide on how many eggs the female lays. The better the nest, the more eggs.", "Interesting facts: Barn swallows are aerial insectivores that consume hundreds of flying insects. They prefer larger insects like moths and wasps."]}, {"path": "/photos/UpperTrailBirds-Image3.jpg", "type": "image", "imageAlt": "Photo of a white and olive-grey bird perched on a branch", "title": "Golden Crowned Kinglet", "description": ["Description: These tiby songbirds are olive-grey above with white underparts, with thin bills and short tails. They have white wing bars, a black stripe through the eyes and a yellow crown surrounded by black. The adult male has an orange patch in the middle of the yellow crown.", "Reproductive habits: Females lay around 3 to 11 eggs and incubate them for 14 to 15 days.", "Interesting facts: Outside the breeding season, Golden-crowned kinglets are social and will flock with other small songbirds such as Black-capped chickadees and Yellow-rumped warblers."]}, {"path": "/photos/UpperTrailBirds-Image9.jpg", "type": "image", "imageAlt": "Photo of a brown and black bird standing on a flowering plant", "title": "Cedar Waxwing", "description": ["Description: A sleek, medium-sized songbird with silky brown and grey plumage, a black eye mask, and a yellow-tipped tail. Named for the red, waxy tips on its wing feathers, it's often seen in flocks near fruiting trees.", "Reproductive habits: Cedar Waxwings are late nesters, typically breeding in mid to late summer, when fruit is most abundant. The female builds the nest — a task that can take 5 to 6 days and over 2,500 trips! She may even “borrow” materials from other birds' nests to speed things up. Nests are usually placed 6 to 20 feet above ground in trees or shrubs, often near water or fruiting plants.", "Interesting facts: Cedar Waxwings can survive on fruit alone for long periods. They sometimes get tipsy from fermented berries. Their tail tips can turn orange from eating non-native berries and they are excellent seed dispersers. The oldest known individual lived over 7 years."]}, {"path": "/photos/CedarWaxwingArt.png", "type": "image", "imageAlt": "Drawing of a Cedar Waxwing", "title": "Cedar Waxwing", "description": ["Drawing by Bronwen Wood, 2025"]}, {"path": "/photos/UpperTrailBirds-Image6.jpg", "type": "image", "imageAlt": "Photo of a light reddish-brown and white bird standing in the grass", "title": "Hermit Thrush", "description": ["Description: Adults are mainly brown on the upperparts, with reddish tails. The underparts are white with dark spots on the breast and grey or brownish flanks. They have pink legs and a white eye ring. Birds in the east are more olive-brown on the upperparts; western birds are more grey-brown.", "Reproductive habits: The Hermit Thrush is a monogamous bird, which means it has a singular mate. Females lay 3 to 6 eggs per clutch, which are incubated for about 12 to 14 days.", "Interesting facts: Hermit Thrushes sometimes use one of their feet to shake grass and clumps of dead vegetation. They do this to scare insects out of hiding."]}, {"path": "/photos/UpperTrailBirds-Image78.jpg", "type": "image", "imageAlt": "Two photos side-by-side, of a grey-ish brown bird with a yellow rear standing on a red-leafed plant and a bird with a bright yellow face and olive-green plumage standing on a woody branch", "title": "Warblers (yellow-rumped & black throated green)", "description": ["Description: These small, colourful songbirds are in the wood-warbler family. The Yellow-rumped warbler is known for its grey body and bright yellow patches on the rump, sides, and crown. The Black-throated Green warbler features a vivid yellow face, olive back, and a distinctive black throat in males. Both are commonly seen in our region during migration.", "Reproductive habits: These warblers breed in coniferous or mixed forests, building cup-shaped nests high in trees. Females lay 3-5 eggs, incubating them for about 12 days. Both parents feed the chicks, which fledge within 10-12 days. They are monogamous during the breeding season and use song to defend territory.", "Interesting facts: Yellow-rumped warblers can digest waxy berries, allowing them to winter farther north than most warblers. Black-throated Green warblers are long-distance migrants, wintering in Central America and the Caribbean. Both species are important indicators of forest health and are commonly heard before they are seen."]}], "description": "As you walk the trails of Gateway Park, let your ears guide you. The air is alive with the songs of birds that change with the seasons. From the cheerful melodies of warblers in spring to the crisp calls of sparrows in autumn, each visit offers a new chorus. Migratory songbirds pass through in waves, painting the skies and treetops with colour and sound as they journey between breeding and wintering grounds. Even in winter, hardy species remain, their songs a quiet echo in the crisp air. Each season brings a new soundtrack—so come back often, bring your binoculars, listen closely, and discover how the park's birdlife changes with the rhythm of the year. Birding here is more than a hobby—it's a peaceful way to connect with nature, to slow down and notice the subtle rhythms of the land."}